/*
--------------------------------------------------
【const在C与C++中的区别】
--------------------------------------------------
*/

//全局const会被存储到只读数据段。
const int constA = 10;
int main(){
   int* p = (int*)&constA;
   *p = 200;
}
//C与C++编译通过，运行失败：试图修改只读数据段的数据。


/*
--------------------------------------------------
C++： 
	全局const当声明extern或者对变量取地址时，编译器会分配存储地址，变量存储在只读数据段。


C语言中：
	局部const存储在堆栈区，只是不能通过变量直接修改const只读变量的值，
	但是可以跳过编译器的检查，通过指针间接修改const值。
--------------------------------------------------
*/

const int constA = 10;
int* p = (int*)&constA;
*p = 300;
printf("constA:%d\n",constA);
printf("*p:%d\n", *p);