#define _CRT_SECURE_NO_WARNINGS

#include <iostream>
#include <string>
using namespace std;

/*
--------------------------------------------------
引用：
	int a = 10;
	int& ref = a;
实现方式：
	int * const ref = &a;//ref是常指针，必须引用初始化
	ref = 20;	//编译器检测到ref为引用，即自动转换为：ref = 20;（解引用）
--------------------------------------------------
*/

/*
--------------------------------------------------
函数返回值为引用，可做左值参与运算：
	int& test_Ref()
	{
		int a = 10;
		return a;
	}
--------------------------------------------------
*/

/*
--------------------------------------------------
常量引用：
	const int &ref = 10;
编译器实现：
	int temp = 10;
	const int &ref = temp;
	//创建了临时变量——临时空间ref。
--------------------------------------------------
*/

/*
--------------------------------------------------
指针的引用：
	1.简化指针。
	2.用通缉指针的引用给同级指针分配空间。
	int * p = (int *)&ref;
	*p = 1000;//（ref此时为1000）
	// 使用场景：
	// 	修饰函数形参，防止误操作。
--------------------------------------------------
*/


int main()
{
	system("pause");
	return 0;
}